import React, { Component } from 'react';
import ReactMarkdown from 'react-markdown';
import dedent from "dedent";


export default class Agreement extends Component {
    static description = {
        lang: 'uk',
        version: '1',
        type: 'simple',
        slug: 'agreement',
        name: 'Угода про використання - проста, версія 1, українською',
    };

    componentDidMount() {
        const { id } = this.props.match.params;
        document.title = `${id} - Угода Про Використання`;
    }

    render() {
        const { id } = this.props.match.params;
        const url = window.location.href;

        return (
            <ReactMarkdown source={dedent`

            # Угода про використання Додатку «${id}»
            
            ## 1. ЗАГАЛЬНІ ПОЛОЖЕННЯ

            1.1. Ця Угода (далі - «Угода») регламентує відносини між
                 розробником додатка «${id}» (далі - «Розробник»), і Фізичною
                 особою, яка належним чином приєдналася до цієї Угоди
                 (далі - «Користувач») для отримання права використання
                 Додатку.

            Користувачем Додатку вважається будь яка фізична особа,
            яка коли-небудь здійснювала доступ до Додатку, та досягла
            віку допустимого для акцепту цієї Угоди.

            1.2. Ця Угода є відкритим і загальнодоступним документом.
                 Чинна редакція Угоди використання Додатку розташовується в
                 мережі Інтернет за адресою: ${url}

            1.3. Умови цієї Угоди є публічною офертою відповідно до
                 ст. 641 Цивільного кодексу України. Розробник надає
                 Користувачеві права доступу і використання Додатка на
                 умовах цієї Угоди.

            1.4. Ця Угода може бути змінена та/або доповнена Розробником в
                 односторонньому порядку, без будь якого спеціального
                 повідомлення. При цьому продовження використання
                 Додатка після внесення змін і/або доповнень до цієї Угоди,
                 означає згоду Користувача з такими змінами та/або
                 доповненнями.

            1.5. Приймаючи умови цієї Угоди, Користувач підтверджує
                 свої право- і дієздатність, приймає на себе всі можливі
                 ризики, в тому числі матеріальні, пов'язані з його
                 діями по використанню Додатка.

            1.6. Користувач приймає умови користування Додатком зазначені в
                 мережі Інтернет за посиланням ${url}

            1.7. Додаток надається в користування за принципом «як є».
                 Розробник не несе відповідальності за помилки, збої у роботі
                 Програми, збереження даних Користувача та інші недоліки
                 пов’язані з порушенням функціювання в Додатку та їх наслідки
                 які виникли у Користувача, в тому числі: реальний збиток,
                 упущену вигоду, збитки, моральну шкоду, шкоду честі,
                 гідності та ділової репутації.

            1.8. Додаток може містити посилання на веб-сайти, веб-сервіси чи
                 додатки, що належать третім сторонам. Такі веб-сайти,
                 веб-сервіси та додатки не належать та не контролюються
                 Розробником.

            1.9. Додаток може розміщуватись на платформі (у веб-сервісі),
                 що належить третім сторонам і не контролюється Розробником.
                 В цьому випадку Користувач забов'язується прийняти та
                 дотримуватись угоди використання зазначенної платформи.

            1.10. Розробник не має впливу і не несе відповідальності
                  за будь-які дані, розміщені на веб-сайтах, веб-сервісах та
                  додатках, зазначених в пунктах 1.8-1.9 цієї Угоди, та за
                  роботу таких веб-сайтів, веб-сервісів та додатків.

            1.11. Розробник не контролює та не несе відповідальності, прямо
                  чи опосередковано, за використання Користувачем веб-сайтів,
                  веб-сервісів та додатків, зазначених в пунктах 1.8-1.9
                  цієї Угоди, а також наслідки що виникли у зв’язку з
                  таким використанням, в тому числі: реальний збиток,
                  упущену вигоду, збитки, моральну шкоду, шкоду честі,
                  гідності та ділової репутації.
            
            ## 2. ПРАВА ТА ОБОВ'ЯЗКИ КОРИСТУВАЧА

            2.1. Користувач зобов'язується належним чином дотримуватися
                 умови цієї Угоди.

            2.2. Користувач має право використання Додатку виключно з метою
                 особистого використання відповідно до умов цієї Угоди.

            2.3. Користувач зобов'язується не використовувати Додаток в
                 порушення прав і законних інтересів Розробника, інших
                 правовласників, третіх осіб, та цієї Угоди.

            2.4. Користувач несе особисту відповідальність за використання
                 Додатку будь-якими способами, прямо не дозволеними цією Угодою.

            2.5. Користувач не має права здійснювати будь-які несанкціоновані
                 дії з Додатком.

            2.6. Користувач зобов'язаний ознайомитися з усією інформацією
                 про Додаток, яка розміщена в мережі Інтернет за
                 посиланням ${url} . Використання Додатку підтверджує
                 виконання Користувачем зазначеного в цьому пункті
                 зобов'язання. У разі незгоди з умовами цієї Угоди,
                 використання Додатка Користувачем повинно бути
                 негайно припинено.

            2.7. Користувачеві надається можливість безоплатно
                 користуватися повним функціоналом додатку.

            2.8. Умови використання Додатка, зазначені в мережі Інтернет
                 за посиланням ${url} можуть бути змінені та/або доповнені
                 Розробником в односторонньому порядку. При цьому продовження
                 використання Додатка після внесення змін і/або таких
                 доповнень, означає згоду Користувача з такими змінами
                 та/або доповненнями.

            2.9. В разі розміщення Додатку на платформі (у веб-сервісі),
                 що належить третім сторонам і не контролюється Розробником,
                 Користувач забов'язується прийняти та дотримуватись угоди
                 використання зазначенної платформи.
            
            ## 3. ПРАВА ТА ОБОВ'ЯЗКИ РОЗРОБНИКА

            3.1. Розробник має право передавати права та обов'язки
                 за цією Угодою, третім особам в цілях виконання цієї Угоди
                 без додаткової згоди Користувача.

            3.2. Розробник має право направляти Користувачеві будь-яким
                 способом інформацію про функціонування Програми, в тому
                 числі розміщувати відповідну інформацію в самому Додатку.

            3.3. Розробник має право заблокувати доступ Користувача до
                 Додатка або його частини в разі виявлення порушень
                 Користувачем цієї Угоди.

            3.4. Розробник має право без попереднього повідомлення обмежити,
                 призупинити або припинити користування Додатком без
                 відшкодування Користувачеві понесених збитків, в тому
                 числі в разі, якщо у Розробника є дані вважати, що
                 Користувач або його афілійовані особи
                 (навмисно чи ненавмисно):
               
            - при користуванні Додатком порушують Законодавство, положення
              цієї Угоди або права і законні інтереси третіх осіб;
            - користуються Додатком недобросовісно, надмірно або не у
              відповідності з його призначенням;
            - завдають шкоди Додатку або його працездатності;
            - здійснюють спроби несанкціонованого доступу до Додатка та
              інформації яка міститься в ньому;
            - створюють загрозу збою технічних і/або програмних засобів
              Розробника і/або третіх осіб.

            3.5. Розробник має право без попереднього повідомлення обмежити,
                 призупинити або припинити користування Додатком.
            
            ## 4. ГАРАНТІЇ ТА ВІДПОВІДАЛЬНІСТЬ СТОРІН

            4.1. Для виконання цієї Угоди можуть залучатися треті особи.
                 Користувач підтверджує, що зазначеним третім особам надаються
                 такі ж права, як і власникові прав на використання Програми,
                 в тому числі щодо використання персональних даних Користувача.

            4.2. Користувач гарантує, що не буде робити будь-яких дій,
                 спрямованих виключно на заподіяння шкоди Розробникові,
                 операторам стільникового мобільного зв'язку, правовласникам
                 або іншим особам.

            4.3. У разі порушення правил використання Додатка, обов'язків
                 Користувача і заборон, зазначених у розділі 3 цієї Угоди,
                 а також в разі порушення пункту 4.2 цієї Угоди, Користувач
                 зобов'язується відшкодувати Розробникові збитки, завдані
                 такими діями в повному обсязі.

            4.4. У разі втрати, видалення, пошкодження внесеної Користувачем
                 в Додаток інформації в результаті дій/бездіяльності
                 Користувача, всю відповідальність несе Користувач.

            4.5. Визнаючи міжнародний характер інтернету, Користувач
                 приймає на себе відповідальність за дотримання всіх місцевих
                 правил і законів, що стосуються дій Користувача в мережі.

            4.6. Користувач Додатку зобов’язується не виконувати дій,
                 які можуть розглядатись як порушення законодавства України
                 або норм міжнародного права, у тому числі у сфері
                 інтелектуальної власності, авторських та/або суміжних прав,
                 а також будь яких дій, які призводять або можуть
                 призвести до порушення нормальної роботи Додатку.
            
            ## 5. ЗАКЛЮЧНІ ПОЛОЖЕННЯ

            5.1. У разі виникнення будь-яких суперечок або розбіжностей,
                 пов'язаних з виконанням цієї Угоди, Користувач і Розробник
                 докладуть усіх зусиль для їх вирішення шляхом проведення
                 переговорів між ними. У разі, якщо суперечки не будуть
                 вирішені шляхом переговорів, спори підлягають вирішенню в
                 відповідному компетентному суді за місцем знаходження
                 Розробника.

            5.2. Жодна із Сторін Угоди не несе відповідальності за
                 невиконання або неналежне виконання зобов'язань за цією
                 Угодою, якщо належне виконання виявилося неможливим
                 внаслідок непереборної сили.

            5.3. Ця Угода набирає чинності для Користувача від початку
                 використання Додатку і діє безстроково, на протязі усього
                 періоду використання Користувачем Додатку.

            5.4. Ця Угода складена українською мовою.

            5.5. Якщо будь-яке положення цієї Угоди буде визнано недійсним,
                 це не впливає на дійсність або застосовність інших
                 положень цієї Угоди.

            `}/>
        );
    }
}
