import React, { Component } from 'react';
import ReactMarkdown from 'react-markdown';
import dedent from "dedent";


export default class PrivacyPolicy extends Component {
    componentDidMount() {
        const { id } = this.props.match.params;
        document.title = `${id} - Політика конфіденційності`;
    }

    render() {
        const { id } = this.props.match.params;

        return (
            <ReactMarkdown source={dedent`

            # Політика конфіденційності додатку «${id}»

            1. Термін "особиста інформація", який використовується в цьому
               документі, визначається як будь-яка інформація, яка ідентифікує
               або може використовуватися для ідентифікації, зв'язку або
               пошуку людини, до якої така інформація має відношення.
               Особиста інформація, яку ми збираємо, буде предметом данної
               політики конфіденційності, до якої в майбутньому можуть
               вноситись правки.
            2. Ми не запитуємо Вашу адресу електронної пошти, телефон або
               якусь інформацію про Вас.
            3. Ми не продаємо контент.
            4. Ми не вимагаємо реєстрації.
            5. Безпека Вашої персональної інформації не буде порушена.
            6. Ми не просимо інформацію про місцезнаходження через наш додаток.
            7. Ми не відправляємо на електронну пошту розсилку новин.

            `}/>
        );
    }
}
